Ran Apply for project: `dev` dir: `non-prod/sgp-southeast-1/dev/ec2` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
exit status 1: running "terragrunt apply -input=false -no-color" in "/root/.atlantis/repos/jiangguoqing/my-iac/11/default/non-prod/sgp-southeast-1/dev/ec2": 
time=2023-03-30T11:48:38+08:00 level=warning msg=No double-slash (//) found in source URL /root/.atlantis/repos/jiangguoqing/my-iac/11/default/provider/ec2. Relative paths in downloaded Terraform code may not work.

[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v3.7.0...
- Installed hashicorp/aws v3.7.0 (signed by HashiCorp)

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

Error: error asking for approval: EOF


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-0a72af05d27b49ccb"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name" = "test"
        }
      + tenancy                      = (known after apply)
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: time=2023-03-30T11:48:48+08:00 level=error msg=Terraform invocation failed in /root/.atlantis/repos/jiangguoqing/my-iac/11/default/non-prod/sgp-southeast-1/dev/ec2/.terragrunt-cache/jaMaZs20Ot_PPRW8P7WEVccxiow/wy1l8B8qUvqhZqIz9joZiT8IVVM prefix=[/root/.atlantis/repos/jiangguoqing/my-iac/11/default/non-prod/sgp-southeast-1/dev/ec2] 
time=2023-03-30T11:48:48+08:00 level=error msg=1 error occurred:
	* exit status 1




```
</details>

